// alert를 .html파일에 <script>태그로 위에서 아래로 몇번 쳤을때, 

// head태그에 js 치면 <script>가 body의 html 태그들보다 먼저 처리되기 때문에 사용자 입장에선 딜레이
//바디에 포함될때, 바디 밑부분이면 html먼저 나와서 js 기능이 불능 가능

//js에선 camelCase로 작명함. or PascalCase

//선언&할당 :
// 선언시 키워드 필요함
// 다른 키워드와 다르게 const는 선언시 무조건 할당해야. 선언만 불가능.
// 그외는 선언하지 않으면 undefined

//var보단 let. var 이미 선언할당 됐는데 이후에 실수로 누가 모르고 선언할당하면 기존 var값에 덮어씌움
// let 변수이름 : 중복선언이 불가능! 재할당은 가능함. 
// 중복 선언시 에러
// var a = 1;
// let a = 1;은 가능

// let a = 1; 
// let a = 1;이나 var a = 1;은 불가능


//const : 선언할때 할당(초기화)을 꼭 해야.
// 재선언 불가능, 재할당 불가능.
//중복 선언시 에러

// 변수 이름짓기 : 문자, 숫자, $, _ 네개만 가능.
// 첫글자 숫자도 불가능
// 예약어도 불가능 : this, if, break 등
// 상수는 대문자. 
// const WIDTH = 1100;
// const CODINGON = "codingon" 

// 자료형
// string 문자열, ""로 감싸면 알아서 문자열로 인식.
// 